{
    "name": "John Doe",
    "email": "south.lake.union.cougar@gmail.com",
    "resume": "OBJECTIVE\n\nSeasoned software developer with 5+ years of experience seeking challenging opportunities in full-stack development.\n\nSKILLS\n\nLanguages: Python, JavaScript, Java, SQL\nFrameworks: React, Node.js, Django, Flask\nCloud: AWS, Docker, Kubernetes\nSoft Skills: Agile, Leadership, Problem-solving\n\nEXPERIENCE\n\nSenior Software Developer | Tech Corp\n2020-Present\n- Led development of microservices architecture using Python and Docker\n- Implemented CI/CD pipelines reducing deployment time by 40%\n- Mentored junior developers and conducted code reviews\n\nFull Stack Developer | Innovation Inc\n2018-2020\n- Developed responsive web applications using React and Node.js\n- Optimized database queries improving application performance by 30%\n- Collaborated with UX team to implement user-friendly interfaces",
    "cover_letter": "Dear [Company Name],\n\nI am writing to express my interest in the [Position] role at [Company Name]. As a software developer with extensive experience in full-stack development and a passion for creating innovative solutions, I am excited about the opportunity to contribute to your team.\n\nIn my current role at Tech Corp, I have successfully led multiple projects utilizing [Job Title] relevant technologies and methodologies. I have a proven track record of delivering high-quality solutions while mentoring team members and fostering a collaborative environment.\n\nI am particularly drawn to [Company Name]'s commitment to innovation and its impact in the technology sector. I believe my technical expertise and leadership experience make me an ideal candidate for this position.\n\nThank you for considering my application. I look forward to discussing how I can contribute to [Company Name]'s continued success.\n\nBest regards,\n[Your Name]",
    "notes": "Prefers remote work opportunities. Interested in full-stack and backend positions. Available for immediate start."
} 